import 'package:flutter/material.dart';
import 'package:flutter_html/flutter_html.dart';
// import 'package:flutter_html/flutter_html.dart';

import '../../constants/constants.dart';

class WhoWeAre extends StatelessWidget {
  const WhoWeAre({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Container(
      color: MAIN_COLOR,
      child: SafeArea(
        child: Scaffold(
          body: SingleChildScrollView(
            child: Container(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  mainAxisAlignment: MainAxisAlignment.start,
                  children: [
                    Padding(
                      padding:
                          const EdgeInsets.only(top: 10, left: 20, right: 10),
                      child: Row(
                        mainAxisAlignment: MainAxisAlignment.spaceBetween,
                        children: [
                          IconButton(
                              onPressed: () {
                                Navigator.pop(context);
                              },
                              icon: Icon(
                                Icons.arrow_back_sharp,
                                color: MAIN_COLOR,
                                size: 30,
                              )),
                          Padding(
                            padding: const EdgeInsets.only(left: 30),
                            child: Text(
                              "من نحن",
                              style: TextStyle(
                                  fontSize: 20, fontWeight: FontWeight.bold),
                            ),
                          ),
                          Container()
                        ],
                      ),
                    ),
                    Container(
                        width: double.infinity,
                        child: Text(
                            "في عالم سريع التطور ومتغير باستمرار، تبرز شركة 'فوري' كمثال يحتذى به في مجال التجارة الإلكترونية، حيث تم تأسيسها في عام 2023 بهدف تقديم تجربة تسوق عبر الإنترنت لا مثيل لها. مع تركيزها الشديد على الجودة والإتقان، تسعى 'فوري' دائماً لتقديم منتجات عالية الجودة بأسعار تنافسية، مما يجعلها واحدة من أبرز الأسماء في مجال بيع الملابس والمنتجات المتنوعة عبر الإنترنت.منذ بدايتها، كانت 'فوري' ملتزمة بتقديم تجربة تسوق استثنائية لعملائها. تتمثل هذه الالتزامات في توفير تشكيلة واسعة من الملابس والمنتجات المتنوعة التي تلبي كافة الاحتياجات والأذواق، من الملابس العصرية إلى الأساسيات اليومية، مع الحرص على أن تكون كل قطعة معروضة في المتجر على أعلى مستوى من الجودة.بالإضافة إلى التزامها بالجودة، تفخر 'فوري' بتقديم أسعار تنافسية تجعل التسوق عبر الإنترنت في متناول الجميع. تتميز الشركة بنظام تسعير شفاف يضمن للعملاء الحصول على أفضل الصفقات الممكنة، دون المساومة على جودة المنتجات.أحد العوامل الرئيسية التي تميز 'فوري' هو توفيرها لخدمة توصيل سريعة وفعالة. تدرك الشركة أهمية الوقت لعملائها، ولذلك تعمل جاهدة لضمان وصول المنتجات في أسرع وقت ممكن وبأعلى مستويات الكفاءة.في ظل النمو المتزايد للتجارة الإلكترونية، تستمر 'فوري' في الابتكار والتحسين المستمر لتلبية متطلبات السوق المتغيرة. تقوم الشركة بتحديث مجموعاتها بانتظام لضمان تقديم أحدث الاتجاهات والأنماط، مما يجعلها الوجهة المفضلة للمتسوقين الباحثين عن التنوع والجودة.تتبنى 'فوري' أيضاً مفهوم الاستدامة في عملياتها، حيث تحرص على اتباع أفضل الممارسات البيئية في كل خطوة من خطوات سلسلة التوريد. من خلال التركيز على الممارسات المستدامة، تسعى الشركة إلى تقليل البصمة البيئية لعملياتها وتعزيز مستقبل أكثر استدامة للجميع.لتحقيق رضا العملاء، تعتمد 'فوري' على فريق خدمة عملاء متميز، يتواجد لتقديم الدعم والمساعدة في كل خطوة من خطوات تجربة التسوق. يتم تدريب هذا الفريق على أعلى مستوى لضمان تقديم مستوى خدمة استثنائي يواكب توقعات العملاء ويتجاوزها.في النهاية، تقف 'فوري' كرمز للتميز في عالم التجارة الإلكترونية، متجاوزة التوقعات ومضيفة قيمة لحياة عملائها من خلال تقديم تجربة تسوق متميزة تجمع بين الجودة، القيمة، والراحة. مع كل هذه العوامل، تستمر الشركة في ترسيخ مكانتها كواحدة من أبرز الأسماء في مجال التجارة الإلكترونية، محققة نجاحاً يتجاوز الحدود ويتوسع باستمرار."))
                  ],
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }

  Html text() {
    return Html(data: _htmlContent);
  }

  final _htmlContent = """
  <div>
    <p>من نحن</p>
    <p>عزيزي المستخدم، عزيزتي  المستدمه ..</p>
    <p>أهلا بكم في أفضل و أحدث تطبيق للتسوق في عالم   
يرجى من حضرتكم الإحاطة بالأمور التالية:</p>
    <p>-نقاط مجانية، تحصلون عليها عند كل عملية شراء من متجر Pal-Dent يمكنكم استبدالها في أي وقت بمنتجات قيّمة من المتجر 
</p>
    <p>-يمكنكم متابعة حالة الطلبيات من خلال التطبيق </p>
    <p>التطبيق يشمل التوصيل لكافة مناطق الضفة الغربية والقدس و الداخل</p>
    <p>التوصيل مجاني من خلال مندوبي Kliamr في المدن التالية:
جنين، نابلس، طولكرم و قلقيلية</p>
    <p>تكلفة التوصيل تضاف للطلبية بقيمة 20 شيقل للمناطق الأخرى داخل الضفة</p>
    <p>-طريقة الدفع المعتمدة لدى المتجر هي الدفع نقدا عند الاستلام</p>
    <p>تكلفة التوصيل تضاف للطلبية بقيمة 20 شيقل للمناطق الأخرى داخل الضفة</p>
    <p>مع كل المودة لحضراتكم .. استمتعوا بالتسوق لدى متجركم Kliamr الأفضل في فلسطين</p>
  </div>
  """;
}
